Autodesk.Revit.DB.Analysis.FlowPositionCharacteristic
The flow position characteristic of the analytical segment cluster.
Since:
2026
Since:
2026

Autodesk.Revit.DB.Analysis.FlowPositionCharacteristic.BullheadCombined
The segment is in the bullhead branch direction with combined flow paths.

Autodesk.Revit.DB.Analysis.FlowPositionCharacteristic.Bullhead
The segment is in the bullhead straight direction where multiple flow paths are combined into the branch segment.

Autodesk.Revit.DB.Analysis.FlowPositionCharacteristic.Combined
The segment flow is combined from multiple other segments.

Autodesk.Revit.DB.Analysis.FlowPositionCharacteristic.Branch
The segment is in the branch direction.

Autodesk.Revit.DB.Analysis.FlowPositionCharacteristic.Straight
The segment is in the straight direction.

Autodesk.Revit.DB.Analysis.FlowPositionCharacteristic.Undefined
The flow position characteristic is undefined.